name: "MSCNN"
layer {
  top: "data"
  top: "label_1_5x5"
  top: "label_1_7x7"
  top: "label_2_5x5"
  top: "label_2_7x7"
  top: "label_3_5x5"
  top: "gt_boxes"
  top: "proj_mat"
  top: "model_mat"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_gt_data_param {
    source: "../../../data/carla/window_files/vehicle_train.txt"
    batch_size: 4
    coord_num: 4
    resize_width: 715
    resize_height: 256
    crop_width: 512
    crop_height: 256
    min_gt_height: 35
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    field_w: 60
    field_w: 84
    field_w: 120
    field_w: 168
    field_w: 240
    field_h: 60
    field_h: 84
    field_h: 120
    field_h: 168
    field_h: 240
    fg_threshold: 0.5
    do_multiple_scale: true
    min_scale: 60
    max_scale: 480
    shuffle: true
    output_gt_boxes: true
    output_projection_matrix: true
    append_3d_info: true
  }
}
layer {
  top: "data"
  top: "label_1_5x5"
  top: "label_1_7x7"
  top: "label_2_5x5"
  top: "label_2_7x7"
  top: "label_3_5x5"
  top: "gt_boxes"
  top: "proj_mat"
  top: "model_mat"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_gt_data_param {
    source: "../../../data/carla/window_files/vehicle_val.txt"
    batch_size: 2
    coord_num: 4
    resize_width: 715
    resize_height: 256
    crop_width: 512
    crop_height: 256
    min_gt_height: 35
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    field_w: 60
    field_w: 84
    field_w: 120
    field_w: 168
    field_w: 240
    field_h: 60
    field_h: 84
    field_h: 120
    field_h: 168
    field_h: 240
    fg_threshold: 0.5
    do_multiple_scale: false
    shuffle: true
    output_gt_boxes: true
    output_projection_matrix: true
    append_3d_info: true
  }
}
layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "loss1_conv1"
  name: "loss1_conv1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "loss1_conv1"
  top: "loss1_conv1"
  name: "loss_relu1"
  type: "ReLU"
}

layer {
  bottom: "loss1_conv1"
  top: "LFCN_1_5x5"
  name: "LFCN_1_5x5"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_1_5x5"
  bottom: "label_1_5x5"
  top: "loss_1_5x5"
  name: "detection_loss_1_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 60
    field_w: 60
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_5x5"
  bottom: "label_1_5x5"
  top: "accuracy_1_5x5"
  top: "boxiou_1_5x5"
  name: "detection_accuracy_1_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 60
    field_w: 60
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}
layer {
  bottom: "loss1_conv1"
  top: "LFCN_1_7x7"
  name: "LFCN_1_7x7"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_1_7x7"
  bottom: "label_1_7x7"
  top: "loss_1_7x7"
  name: "detection_loss_1_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 84
    field_w: 84
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_7x7"
  bottom: "label_1_7x7"
  top: "accuracy_1_7x7"
  top: "boxiou_1_7x7"
  name: "detection_accuracy_1_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 84
    field_w: 84
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}

layer {
  bottom: "conv5_3"
  top: "LFCN_2_5x5"
  name: "LFCN_2_5x5"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_2_5x5"
  bottom: "label_2_5x5"
  top: "loss_2_5x5"
  name: "detection_loss_2_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 120
    field_w: 120
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_5x5"
  bottom: "label_2_5x5"
  top: "accuracy_2_5x5"
  top: "boxiou_2_5x5"
  name: "detection_accuracy_2_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 120
    field_w: 120
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}
layer {
  bottom: "conv5_3"
  top: "LFCN_2_7x7"
  name: "LFCN_2_7x7"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_2_7x7"
  bottom: "label_2_7x7"
  top: "loss_2_7x7"
  name: "detection_loss_2_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 168
    field_w: 168
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_7x7"
  bottom: "label_2_7x7"
  top: "accuracy_2_7x7"
  top: "boxiou_2_7x7"
  name: "detection_accuracy_2_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 168
    field_w: 168
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}
layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "conv6_1"
  name: "conv6_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }

}
layer {
  bottom: "conv6_1"
  top: "conv6_1"
  name: "relu6_1"
  type: "ReLU"
}

layer {
  bottom: "conv6_1"
  top: "LFCN_3_5x5"
  name: "LFCN_3_5x5"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_3_5x5"
  bottom: "label_3_5x5"
  top: "loss_3_5x5"
  name: "detection_loss_3_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 240
    field_w: 240
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_3_5x5"
  bottom: "label_3_5x5"
  top: "accuracy_3_5x5"
  top: "boxiou_3_5x5"
  name: "detection_accuracy_3_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 240
    field_w: 240
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
  }
}


#=================== proposal ======================
layer {
  bottom: "LFCN_1_5x5"
  bottom: "LFCN_1_7x7"
  bottom: "LFCN_2_5x5"
  bottom: "LFCN_2_7x7"
  bottom: "LFCN_3_5x5"
  top: "proposals"
  name: "proposals"
  type: "BoxOutput"
  box_output_param {
    fg_thr: -8
    iou_thr: 0.65
    nms_type: "IOU"
    field_w: 60
    field_w: 84
    field_w: 120
    field_w: 168
    field_w: 240
    field_h: 60
    field_h: 84
    field_h: 120
    field_h: 168
    field_h: 240
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    field_whr: 2
    field_xyr: 2
    max_nms_num: 3000
    num_param_set: 1
  }
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
}
#=================== data preparation for detection subnet ======================
layer {
  bottom: "proposals"
  bottom: "gt_boxes"
  bottom: "proj_mat"
  bottom: "model_mat"
  top: "rois"
  top: "proposal_labels"
  top: "proposal_targets"
  top: "target_inside_weights"
  top: "target_outside_weights"
  top: "proposal_size"
  top: "size_inside_weights"
  top: "size_outside_weights"
  top: "proposal_location"
  top: "location_inside_weights"
  top: "location_outside_weights"
  top: "proposal_distance"
  top: "distance_inside_weights"
  top: "distance_outside_weights"
  top: "proposal_quadrant"
  top: "proposal_orientation"
  top: "orientation_inside_weights"
  top: "orientation_outside_weights"
  top: "match_gt_boxes"
  top: "roi_height"
  name: "proposal_info"
  type: "ProposalTarget"
  include {
    phase: TRAIN
  }
  proposal_target_param {
    cls_num: 5
    batch_size: 256
    fg_fraction: 0.25
    num_img_per_batch: 4
    fg_thr: 0.5
    bg_thr_hg: 0.49
    bg_thr_lw: 0.1
    img_width: 768
    img_height: 576
    output_3d_boxes: true
    has_3d_boxes_and_proj_mat_input: true
  }
  bbox_reg_param {
    bbox_mean: 0 bbox_mean: 0 bbox_mean: 0 bbox_mean: 0
    bbox_std: 0.1 bbox_std: 0.1 bbox_std: 0.2 bbox_std: 0.2
  }
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
}
layer {
  bottom: "proposals"
  bottom: "gt_boxes"
  bottom: "proj_mat"
  bottom: "model_mat"
  top: "rois"
  top: "proposal_labels"
  top: "proposal_targets"
  top: "target_inside_weights"
  top: "target_outside_weights"
  top: "proposal_size"
  top: "size_inside_weights"
  top: "size_outside_weights"
  top: "proposal_location"
  top: "location_inside_weights"
  top: "location_outside_weights"
  top: "proposal_distance"
  top: "distance_inside_weights"
  top: "distance_outside_weights"
  top: "proposal_quadrant"
  top: "proposal_orientation"
  top: "orientation_inside_weights"
  top: "orientation_outside_weights"
  top: "match_gt_boxes"
  top: "roi_height"
  name: "proposal_info"
  type: "ProposalTarget"
  include {
    phase: TEST
  }
  proposal_target_param {
    cls_num: 5
    batch_size: 128
    fg_fraction: 0.25
    num_img_per_batch: 2
    fg_thr: 0.5
    bg_thr_hg: 0.49
    bg_thr_lw: 0.1
    img_width: 768
    img_height: 576
    output_3d_boxes: true
    has_3d_boxes_and_proj_mat_input: true
  }
  bbox_reg_param {
    bbox_mean: 0 bbox_mean: 0 bbox_mean: 0 bbox_mean: 0
    bbox_std: 0.1 bbox_std: 0.1 bbox_std: 0.2 bbox_std: 0.2
  }
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
}
#=================== detection subnet ======================
layer {
  bottom: "conv4_3" 
  top: "conv4_3_2x"
  name: "conv4_3_2x" 
  type: "Deconvolution"
  convolution_param {
    kernel_size: 4 
    stride: 2
    num_output: 512
    group: 512
    pad: 1
    weight_filler: { type: "bilinear" } 
    bias_term: false
  }
  param { lr_mult: 0 decay_mult: 0 }
}

layer {
  name: "roi_pool_org"
  type: "ROIPooling"
  bottom: "conv4_3_2x"
  bottom: "rois"
  top: "roi_pool_org"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.25 # 1/4
    pad_ratio: 0
  }
}
layer {
  name: "roi_pool_ctx"
  type: "ROIPooling"
  bottom: "conv4_3_2x"
  bottom: "rois"
  top: "roi_pool_ctx"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.25 # 1/4
    pad_ratio: 0.25
  }
}
layer {
  name: "roi_pool"
  type: "Concat"
  bottom: "roi_pool_org"
  bottom: "roi_pool_ctx"
  top: "roi_pool"
}
layer {
  bottom: "roi_pool"
  top: "roi_c1"
  name: "roi_c1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 3
    #pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "roi_c1"
  top: "roi_c1"
  name: "roi_c1_relu"
  type: "ReLU"
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "roi_c1"
  top: "fc6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "cls_pred"
  type: "InnerProduct"
  bottom: "fc6"
  top: "cls_pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc6"
  top: "bbox_pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "location_pred"
  type: "InnerProduct"
  bottom: "fc6"
  top: "location_pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "distance_pred_a"
  type: "InnerProduct"
  bottom: "fc6"
  top: "distance_pred_a"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "distance_pred_b"
  type: "InnerProduct"
  bottom: "fc6"
  top: "distance_pred_b"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "distance_pred_scaled"
  type: "Scale"
  bottom: "distance_pred_a"
  bottom: "roi_height"
  top: "distance_pred_scaled"
  scale_param {
    axis: 0
  }
  propagate_down: 1
  propagate_down: 0
}
layer {
  name: "distance_pred"
  type: "Bias"
  bottom: "distance_pred_scaled"
  bottom: "distance_pred_b"
  top: "distance_pred"
  bias_param {
    axis: 0
  }
  propagate_down: 1
  propagate_down: 1
}
layer {
  name: "quadrant_pred"
  type: "InnerProduct"
  bottom: "fc6"
  top: "quadrant_pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "orientation_pred_before_softmax"
  type: "InnerProduct"
  bottom: "fc6"
  top: "orientation_pred_before_softmax"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "orientation_reshaped"
  type: "Reshape"
  bottom: "orientation_pred_before_softmax"
  top: "orientation_reshaped"
  reshape_param {
    shape {
      dim: 0
      dim: 5
      dim: 2
      dim: 1
    }
  }
}

layer {
  name: "orientation_pred"
  type: "Softmax"
  bottom: "orientation_reshaped"
  top: "orientation_pred"
  softmax_param {
    axis: 2
  }
}
layer {
  name: "size_pred"
  type: "InnerProduct"
  bottom: "fc6"
  top: "size_pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 15
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
  
layer {
  bottom: "cls_pred"
  bottom: "proposal_labels"
  top: "loss_cls"
  name: "loss_cls"
  type: "SoftmaxWithLoss"
  loss_weight: 1
  propagate_down: 1
  propagate_down: 0
}
layer {
  name: "cls_accuracy"
  type: "Accuracy"
  bottom: "cls_pred"
  bottom: "proposal_labels"
  top: "cls_accuracy"
}
layer {
  name: "loss_bbox"
  type: "SmoothL1Loss"
  bottom: "bbox_pred"
  bottom: "proposal_targets"
  bottom: "target_inside_weights"
  bottom: "target_outside_weights"
  top: "loss_bbox"
  loss_weight: 1
}
layer {
  name: "loss_location"
  type: "SmoothL1Loss"
  bottom: "location_pred"
  bottom: "proposal_location"
  bottom: "location_inside_weights"
  bottom: "location_outside_weights"
  top: "loss_location"
  loss_weight: 1
}
#layer {
#  name: "loss_distance_a"
#  type: "SmoothL1Loss"
#  bottom: "distance_pred_scaled"
#  bottom: "proposal_distance"
#  bottom: "distance_inside_weights"
#  bottom: "distance_outside_weights"
#  top: "loss_distance_a"
#  loss_weight: .1
#}
layer {
  name: "loss_distance_b"
  type: "SmoothL1Loss"
  bottom: "distance_pred"
  bottom: "proposal_distance"
  bottom: "distance_inside_weights"
  bottom: "distance_outside_weights"
  top: "loss_distance_b"
  loss_weight: .1
}
layer {
  bottom: "quadrant_pred"
  bottom: "proposal_quadrant"
  top: "loss_quadrant"
  name: "loss_quadrant"
  type: "SoftmaxWithLoss"
  loss_weight: 1
  loss_param {
    ignore_label: -1
    normalization: VALID
  }
  propagate_down: 1
  propagate_down: 0
}
layer {
  name: "loss_orientation"
  type: "SmoothL1Loss"
  bottom: "orientation_pred"
  bottom: "proposal_orientation"
  bottom: "orientation_inside_weights"
  bottom: "orientation_outside_weights"
  top: "loss_orientation"
  loss_weight: 1
}
layer {
  name: "loss_size"
  type: "SmoothL1Loss"
  bottom: "size_pred"
  bottom: "proposal_size"
  bottom: "size_inside_weights"
  bottom: "size_outside_weights"
  top: "loss_size"
  loss_weight: 1
}
layer {
  name: "bbox_iou"
  type: "BboxAccuracy"
  bottom: "bbox_pred"
  bottom: "rois"
  bottom: "match_gt_boxes"
  top: "bbox_iou"
  top: "bbox_iou_pre"
  bbox_reg_param {
    bbox_mean: 0 bbox_mean: 0 bbox_mean: 0 bbox_mean: 0
    bbox_std: 0.1 bbox_std: 0.1 bbox_std: 0.2 bbox_std: 0.2
  }
}

